{"updateTime":"2022-01-16T16:20:03.835Z","createTime":"2022-01-16T16:20:03.835Z","content":"My hometown, HsinChu, where the Science Park is located. In that, I had the opportunity to be cultivated by science-oriented education.\n\nAfter first year of undergraduate in Chung Hua University's electrical engineering department, I passed the exam and transferred to Chung Yuan Christian University's physics department. After finishing undergraduate study, I worked as Production Quality Engineer in a semiconductor testing industry, KYEC, for six months then decided to take MSc degree of Information Technology in St Andrews University in the UK.\n\nThere were few extracurricular activities that I joined during undergraduate, such as ballroom dance club, piano club, and basketball team, which are not only for personal hobbies but also get involved as a team player. In order to be fully engaging in the experience of culture difference during studying in the UK, I applied the accommodation where the students stayed mostly came from non-mandarin-speaker students. Thanks to intensive practice of English, after one year, making me nearly forget my mother language by that time.\n\nAfter graduate study, I worked as Field Trial Engineer in HTC for two and a half year, the duty of the job was mobile antenna test domestically and overseas. It needs to be attentive and able to work in fast-pased environment and continuously receive new knowledge of antenna and mobile phone. It was a valuable discipline for a freshman to take bussiness trips overseas and work independently under pressure.\n\nIn oder to keep dynamic and have diversity skills, I headed to France to learn French and French cuisine. I completed the hell's kitchen's internship and running my own catering business afterwards. Through this experience, I've learned the importance of responsibility and cooperation. Due to my poor experience on accounting, the business was fermé.\n\nThen I worked as a VR Test Engineer in HTC. The job was with lots of fun by playing and testing virtual reality games. After ten months, I've considered seriously my career life due to the recall of how much I would love to dive into web technology during graduate study in IT, so I joined the team in CakeTech that allows me to work and learn at the same time. although the aesthetics has been my weakness, the logical thinking discplined by undergraduate study in physics and the knowledge of MySql, php and ERM aquired by graduate study in IT, which leads me to go further on Javascript programming and the logic of database management.\n\nI am very exciting that if there is any chance that I could have more hands-on experience on React and Redux, etc. Or to work as micorfrontend to integrate with different frameworks.\nEvery single day for me is another opportunity to take new challenge and the persuit of becoming a better person who is able to dedicate to perform the duty of a team member of the world."}